TODO.org
JLDrill TODO List

* Process

This file contains the development plan for JLDrill.  The first
section discusses the purpose of the next stable release.  Following
that is the current development release.  The number of JellyBeans
chosen for the development release should be enough so that it can
be released in one or two weeks.

Following the current development release is the next development
release.  New stories can be moved into the current release as
long as there is still time in the iteration to do them.  However,
an equal number of JellyBeans must be moved to the next development
release.

When the release is complete, delete the stories and start again.

* The Upcoming Release is Version 0.6.0

The upcoming stable release will be version 0.6.0.  As usual,
it will be made up of the development releases (from 0.5.1 up).

The rest of 0.6.0 will be devoted to drill functionality.  The idea
is to get the multi-drill types done and to nail down the file
format.  Additionally, some must-have UI (error messages and the
like) will be implemented.

The development versions of 0.5.x will be undergoing a different
process.  Instead of long development releases, the releases will
be done in 1-2 weeks each.  Hopefully this will keep interest
levels up.

* Version 0.5.2

0.5.2 originally meant to focus on UI imporovements, but
I got sidetracked with other issues.  The main improvements
are statistics for forgotten items, better display of examples,
Ruby 1.9.1 compatibility, and ability to study Mandarin Chinese
with traditional characters using CC-EDICT.
  
  :PROPERTIES:
  :COLUMNS: %40ITEM %JellyBeans(Total){+} %Done(Done){+} %Percent(Percent) %CurrentVelocity(Current) %NeededVelocity(Needed)
  :StartDate: <2011-07-14 Thu>
  :CurrentDate:  <2012-01-10 Tue>
  :EndDate: <2012-01-20 Fri>
  :PERCENT: 0
  :CurrentVelocity: 0
  :NeededVelocity: 0
  :END:

** Velocity Table

The velocity table shows an overview of the current development.  The
ITEM column shows which iteration we are doing.  Total shows the total
number of "Jelly Beans" that are scheduled for the release.  A Jelly
Bean is an arbitrary unit of effort.  Done shows how many Jelly Beans
have been finished to date.  Percent shows what percentage of the
iteration is finished.

The last two columns show the velocity for the program.  Current shows
the number of Jelly Beans that have been finished per day.  Needed
shows the number of Jelly Beans per day that must be finished for the
iteration to finish as scheduled.

#+BEGIN: columnview :maxlevel 1 :id local
| ITEM            | Total | Done | Percent | Current | Needed |
|-----------------+-------+------+---------+---------+--------|
| * Version 0.5.2 |    14 |   10 |    71.4 |    0.06 |   0.07 |
#+TBLFM: @2$4=($3/$2)*100;%.1f::@2$5=$3/($PROP_CurrentDate - $PROP_StartDate);%.2f::@2$6=$2/($PROP_EndDate - $PROP_StartDate);%.2f
#+END

Note: To update the current velocity you must set the CurrentDate in
the PROPERTIES section of the section.  When setting TODO tasks to
DONE, you must set the number of JellyBeans done in the PROPERTIES of
the task.

** Current Items

*** DONE Display statistics for forgotten items [2/2]
	In the statistics window, display the statistics for the
	forgotten set as well as the review set.  To be honest, I
	don't really know how I want this to work, so this will
	probably end up being a spike.

	- [X] Create a tabbed interface for the statistics window
    - [X] Make one tab show the statistics for the review set
          and one for the forgotten set

	:PROPERTIES:
	:JellyBeans: 1
	:Done: 1
	:END:

*** DONE Only show the examples when the answer is shown
	Right now the colocations are shown when the new problem is
	made.  Instead, show the colocations when the answer is shown
	for the problem.  Before that a blank screen.

	:PROPERTIES:
	:JellyBeans: 1
	:Done: 1
	:END:

*** DONE Show appropriate examples when the question is shown
	When the question is shown, show the English side of the
	examples when it is a meaning question, Japanese side of the
	example when it is a Kanji question or reading question.  
	Fill in the rest of	the details when the answer is shown.

	:PROPERTIES:
	:JellyBeans: 1
	:Done: 1
	:END:

*** DONE Move to Ruby 1.9
	Currently using Ruby 1.8.7 Move to Ruby 1.9.  This needs to 
	be done before Debian moves over to Ruby 1.9 as its standard.

	:PROPERTIES:
	:JellyBeans: 3
	:Done: 3
	:END:

