TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>JLDrill TODO List</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-12 09:46:27 JST"/>
<meta name="author" content="Mike Charlton"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">JLDrill TODO List</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Process </a></li>
<li><a href="#sec-2">2 The Upcoming Release is Version 0.6.0 </a></li>
<li><a href="#sec-3">3 Version 0.5.2 </a>
<ul>
<li><a href="#sec-3.1">3.1 Velocity Table </a></li>
<li><a href="#sec-3.2">3.2 Current Items </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 Display statistics for forgotten items [2/2] </a></li>
<li><a href="#sec-3.2.2">3.2.2 Only show the examples when the answer is shown </a></li>
<li><a href="#sec-3.2.3">3.2.3 Show appropriate examples when the question is shown </a></li>
<li><a href="#sec-3.2.4">3.2.4 Move to Ruby 1.9 </a></li>
<li><a href="#sec-3.2.5">3.2.5 Chinese Mode for Kanji Popup </a></li>
<li><a href="#sec-3.2.6">3.2.6 Ability to load CC-CEDICT dictionary in Chinese mode </a></li>
<li><a href="#sec-3.2.7">3.2.7 Add Load Path for dictionaries </a></li>
<li><a href="#sec-3.2.8">3.2.8 Replace Tanaka corpus with Tatoeba example sentences </a></li>
<li><a href="#sec-3.2.9">3.2.9 Read Chinese collocations from Tatoeba example sentence </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 Finished &ndash; Version 5.1 </a>
<ul>
<li>
<ul>
<li><a href="#sec-4.1">4.1 Forget items that are too old </a></li>
<li><a href="#sec-4.2">4.2 Reorganize Options UI </a></li>
<li><a href="#sec-4.3">4.3 Put Gem in official repository [5/5] </a></li>
<li><a href="#sec-4.4">4.4 Update Dictionaries </a></li>
<li><a href="#sec-4.5">4.5 Switch between kanji and vocab popups </a></li>
<li><a href="#sec-4.6">4.6 Improve Debian build </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Backlog </a>
<ul>
<li><a href="#sec-5.1">5.1 Items </a>
<ul>
<li><a href="#sec-5.1.1">5.1.1 Ability to switch between Japanese and Chinese mode </a></li>
<li><a href="#sec-5.1.2">5.1.2 Allow users to update their drills </a></li>
<li><a href="#sec-5.1.3">5.1.3 Personalized Directories </a></li>
<li><a href="#sec-5.1.4">5.1.4 Automatically update Dictionary </a></li>
<li><a href="#sec-5.1.5">5.1.5 Automatically update Collocations </a></li>
<li><a href="#sec-5.1.6">5.1.6 Need a mechanism for publishing warnings and errors. </a></li>
<li><a href="#sec-5.1.7">5.1.7 Give feedback to the user when we refuse to edit or add an item. </a></li>
<li><a href="#sec-5.1.8">5.1.8 When save fails, indicate it to the user </a></li>
<li><a href="#sec-5.1.9">5.1.9 Start new drills in Preview mode </a></li>
<li><a href="#sec-5.1.10">5.1.10 New Drill Splash Screen </a></li>
<li><a href="#sec-5.1.11">5.1.11 Simply loading a drill shouldn't modify it </a></li>
<li><a href="#sec-5.1.12">5.1.12 Indicate when the item has been promoted. </a></li>
<li><a href="#sec-5.1.13">5.1.13 Windows Packaging [0/5] </a></li>
<li><a href="#sec-5.1.14">5.1.14 Allow Learn/Unlearn for any arbitrary item </a></li>
<li><a href="#sec-5.1.15">5.1.15 Define the structure of the data in the drill. </a></li>
<li><a href="#sec-5.1.16">5.1.16 Define a structure for grammar. </a></li>
<li><a href="#sec-5.1.17">5.1.17 Display parts of speech tags next to what they modify </a></li>
<li><a href="#sec-5.1.18">5.1.18 Allow the user to choose what tags to display. </a></li>
<li><a href="#sec-5.1.19">5.1.19 Associate data items with the dictionary they belong to. </a></li>
<li><a href="#sec-5.1.20">5.1.20 彼処 かしこ finds あそこ </a></li>
<li><a href="#sec-5.1.21">5.1.21 Allow undo </a></li>
<li><a href="#sec-5.1.22">5.1.22 Insert Popup Before Item </a></li>
<li><a href="#sec-5.1.23">5.1.23 Aggressive Search </a></li>
<li><a href="#sec-5.1.24">5.1.24 Create a recent used menu for loading drills that you've used recently. </a></li>
<li><a href="#sec-5.1.25">5.1.25 One of the items in the working set had a potential schedule of 72 days </a></li>
<li><a href="#sec-5.1.26">5.1.26 Time to learn after the first item is waaay too big (10798.7s) [1/2] </a></li>
<li><a href="#sec-5.1.27">5.1.27 Full test coverage for all the model objects </a></li>
<li><a href="#sec-5.1.28">5.1.28 Full test coverage for all the contexts </a></li>
<li><a href="#sec-5.1.29">5.1.29 Don't steal focus when putting up windows that take no input. </a></li>
<li><a href="#sec-5.1.30">5.1.30 Allow user to set the formatting for each type of data. </a></li>
<li><a href="#sec-5.1.31">5.1.31 Rename the methods that take Vocabulary </a></li>
<li><a href="#sec-5.1.32">5.1.32 Create a keyboard only mode. </a></li>
<li><a href="#sec-5.1.33">5.1.33 Create a dictionary back end to allow it to use online dictionaries, </a></li>
<li><a href="#sec-5.1.34">5.1.34 Create Redhat packaging. </a></li>
<li><a href="#sec-5.1.35">5.1.35 Create OSX packaging. </a></li>
<li><a href="#sec-5.1.36">5.1.36 Allow user to modify the global backoff. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Process </h2>
<div class="outline-text-2" id="text-1">


<p>
This file contains the development plan for JLDrill.  The first
section discusses the purpose of the next stable release.  Following
that is the current development release.  The number of JellyBeans
chosen for the development release should be enough so that it can
be released in one or two weeks.
</p>
<p>
Following the current development release is the next development
release.  New stories can be moved into the current release as
long as there is still time in the iteration to do them.  However,
an equal number of JellyBeans must be moved to the next development
release.
</p>
<p>
When the release is complete, delete the stories and start again.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Upcoming Release is Version 0.6.0 </h2>
<div class="outline-text-2" id="text-2">


<p>
The upcoming stable release will be version 0.6.0.  As usual,
it will be made up of the development releases (from 0.5.1 up).
</p>
<p>
The rest of 0.6.0 will be devoted to drill functionality.  The idea
is to get the multi-drill types done and to nail down the file
format.  Additionally, some must-have UI (error messages and the
like) will be implemented.
</p>
<p>
The development versions of 0.5.x will be undergoing a different
process.  Instead of long development releases, the releases will
be done in 1-2 weeks each.  Hopefully this will keep interest
levels up.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Version 0.5.2 </h2>
<div class="outline-text-2" id="text-3">


<p>
0.5.2 originally meant to focus on UI imporovements, but
I got sidetracked with other issues.  The main improvements
are statistics for forgotten items, better display of examples,
Ruby 1.9.1 compatibility, and ability to study Mandarin Chinese
with traditional characters using CC-EDICT.
</p>


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Velocity Table </h3>
<div class="outline-text-3" id="text-3.1">


<p>
The velocity table shows an overview of the current development.  The
ITEM column shows which iteration we are doing.  Total shows the total
number of "Jelly Beans" that are scheduled for the release.  A Jelly
Bean is an arbitrary unit of effort.  Done shows how many Jelly Beans
have been finished to date.  Percent shows what percentage of the
iteration is finished.
</p>
<p>
The last two columns show the velocity for the program.  Current shows
the number of Jelly Beans that have been finished per day.  Needed
shows the number of Jelly Beans per day that must be finished for the
iteration to finish as scheduled.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">ITEM</th><th scope="col">Total</th><th scope="col">Done</th><th scope="col">Percent</th><th scope="col">Current</th><th scope="col">Needed</th></tr>
</thead>
<tbody>
<tr><td>* Version 0.5.2</td><td>14</td><td>10</td><td>71.4</td><td>0.06</td><td>0.07</td></tr>
</tbody>
</table>


<p>
Note: To update the current velocity you must set the CurrentDate in
the PROPERTIES section of the section.  When setting TODO tasks to
DONE, you must set the number of JellyBeans done in the PROPERTIES of
the task.
</p>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Current Items </h3>
<div class="outline-text-3" id="text-3.2">



</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1"><span class="section-number-4">3.2.1</span> <span class="done DONE"> DONE</span> Display statistics for forgotten items [2/2] </h4>
<div class="outline-text-4" id="text-3.2.1">

<p>In the statistics window, display the statistics for the
forgotten set as well as the review set.  To be honest, I
don't really know how I want this to work, so this will
probably end up being a spike.
</p>
<ul>
<li>
<b>[X]</b> Create a tabbed interface for the statistics window
</li>
<li>
<b>[X]</b> Make one tab show the statistics for the review set
and one for the forgotten set


</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2"><span class="section-number-4">3.2.2</span> <span class="done DONE"> DONE</span> Only show the examples when the answer is shown </h4>
<div class="outline-text-4" id="text-3.2.2">

<p>Right now the colocations are shown when the new problem is
made.  Instead, show the colocations when the answer is shown
for the problem.  Before that a blank screen.
</p>

</div>

</div>

<div id="outline-container-3.2.3" class="outline-4">
<h4 id="sec-3.2.3"><span class="section-number-4">3.2.3</span> <span class="done DONE"> DONE</span> Show appropriate examples when the question is shown </h4>
<div class="outline-text-4" id="text-3.2.3">

<p>When the question is shown, show the English side of the
examples when it is a meaning question, Japanese side of the
example when it is a Kanji question or reading question.  
Fill in the rest of the details when the answer is shown.
</p>

</div>

</div>

<div id="outline-container-3.2.4" class="outline-4">
<h4 id="sec-3.2.4"><span class="section-number-4">3.2.4</span> <span class="done DONE"> DONE</span> Move to Ruby 1.9 </h4>
<div class="outline-text-4" id="text-3.2.4">

<p>Currently using Ruby 1.8.7 Move to Ruby 1.9.  This needs to 
be done before Debian moves over to Ruby 1.9 as its standard.
</p>

</div>

</div>
