TODO.org
*** DONE Chinese Mode for Kanji Popup
	Create an option to go to Chinese mode that presents the
	chinese readings rather than the Japanese readings for
	the chinese characters.  Note that this only works for
	traditional (not simplified) characters.

	:PROPERTIES:
	:JellyBeans: 1
	:Done: 1
	:END:

*** DONE Ability to load CC-CEDICT dictionary in Chinese mode
	If the Chinese mode option is set, use a Chinese dictionary
	parser to read CC-CEDICT dictionaries.  In this mode, you
	can hover over traditional (not simplified) characters
	to look up chinese words using the dictionary popup.
	You can also search for and add entries in Add Vocab
	and Edit Vocab windows.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 2
	:END:

*** TODO Add Load Path for dictionaries
	Create a load path for the dictionaries that prioritizes
	directories where the dictionaries might be.  Add /usr/share/edict
	to the end of the load path and remove the special configuration
	for Debian. This will allow Debian users to install their
	own edict dictionary if they don't want to use the old one
	in Debian.  This feature is necessary so that we don't have to
	jump through hoops to find the cedictionary in Debian.

	:PROPERTIES:
	:JellyBeans: 1
	:Done: 1
	:END:

*** TODO Replace Tanaka corpus with Tatoeba example sentences
	Tatoeba is the replacesment for the Tanaka corpus upstream.
	There are 3 CSV files now -- One for collocations, one
	for sentence type and one for the old Tanaka B line information.
	Read in the Japanese collocations and Tanaka B line information
	in Japanese mode.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 0
	:END:

*** TODO Read Chinese collocations from Tatoeba example sentence
	In Chinese mode, read and select the Chinese collocations.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 0
	:END:


* Finished -- Version 5.1

This is a packaging release.  However, I have added a single
feature because I needed it for my own study.

Unlike previous releases, 0.5.1 will be released as a stable release.
For all platforms, installing ruby (with rubygems) and typing "gem
install jldrill" will install jldrill and all its dependencies.  On
On Linux, there will be a debian package.  Both gems and debian packages 
will be submitted to the appropriate people so that it is easy to install.
Unfortunately, unless I can get a Mac, there will be no Mac
installation.

*** DONE Forget items that are too old
   Sometimes when you haven't used the app for a long time items
   get very old.  Their reviewRate becomes large.  This is not
   a problem in itself, but when you start to review items they
   will have a short duration.  If the reviewRate is something like
   10x, then it might take 50 days until we rereview a new item.
   Therefore make a new set of items called Forgetten.  Review
   Items that have a reviewRate higher than some threshold (4???)
   are moved to the Forgetten set.  Forgetten set items work just like
   the Review set items except that are introduced like New set
   items.  So this means the user gets Review set items until they
   get 90% right.  Then they get Forgetten set items.  Once an expired
   set item is reviewed, it goes back into the Review set.  After
   all the Forgetten set items are finished, then we go back to showing
   New set items.  This gives priority to actively reviewed items
   without losing the valuable sorting of old items.
   There is an option for setting the threshold.  If the threshold
   is 0 (default) then no items are forgotten.

   :PROPERTIES:
   :JellyBeans: 2
   :Done: 2
   :END:

*** DONE Reorganize Options UI
	The UI is ugly and disorganized for the Options window.
	Organize the options so that they have a grouping that makes
	sense and try to visually improve the look.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 1
   :END:

*** DONE Put Gem in official repository [5/5]
    - [X] Make dependencies for gtk2
    - [X] Push to official repositories
    - [X] Test on Linux and Windows to make sure it installs properly
    - [X] Update documentation for Windows install
    - [X] Document potential problems with debian and gem coexistance.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 1
   :END:

*** DONE Update Dictionaries
	Update the EDict and Tanaka corpus dictionaries to the
	latest version.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 1
   :END:

*** DONE Switch between kanji and vocab popups
	Make it so that you can switch between the kanji and vocab
    popups without having to move the mouse in between.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 1
   :END:

*** DONE Improve Debian build
	The Debian build system was not being done the "Debian way".
	Modify it so that it it lintian clean and build a source
	package.
	
* Backlog

These items are ideas that may or may not make it into
an upcoming development version.  They are organized loosely
by how important I think they are (the most important is
first).  Simply being on this list is no guarantee that
I will implement it.  However, items near the top are very
likely to appear in the next release or two.  If you have
feedback on this list, or its order, please email me.

** Items

*** TODO Ability to switch between Japanese and Chinese mode
	When when one of the dictionaries is loaded and you load a file
	that uses the other language, the previous dictionary remains.
	It should not use it in the other language.  If the new language
	dictionary is set to autoload, it should autoload, replacing the
	previous dictionary in memory.  However, if a new language dictionary
	is not loaded, the previous dictionary should not be removed.

*** TODO Allow users to update their drills
   A user can update a drill by appending the new version to their drill.
   But if the vocabulary has changed in the new/old drill (because the
   dictionary was updated for instance), the new vocabulary will be added
   as a new item rather than updating the old item.  Put a unique
   ID on each item.  When merging, if the IDs are the same overwrite the old
   one.  For old drills, if there is no ID, assume the items are the same
   if the position, reading and kanji are the same.  (Not sure about the
   position).

   :PROPERTIES:
   :JellyBeans: 2
   :Done: 0
   :END:

*** TODO Personalized Directories
	Create a configuration directory that contains the users configuration
	for JLDrill.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 0
	:END:

