TODO.html

<div id="outline-container-3.2.5" class="outline-4">
<h4 id="sec-3.2.5"><span class="section-number-4">3.2.5</span> <span class="done DONE"> DONE</span> Chinese Mode for Kanji Popup </h4>
<div class="outline-text-4" id="text-3.2.5">

<p>Create an option to go to Chinese mode that presents the
chinese readings rather than the Japanese readings for
the chinese characters.  Note that this only works for
traditional (not simplified) characters.
</p>

</div>

</div>

<div id="outline-container-3.2.6" class="outline-4">
<h4 id="sec-3.2.6"><span class="section-number-4">3.2.6</span> <span class="done DONE"> DONE</span> Ability to load CC-CEDICT dictionary in Chinese mode </h4>
<div class="outline-text-4" id="text-3.2.6">

<p>If the Chinese mode option is set, use a Chinese dictionary
parser to read CC-CEDICT dictionaries.  In this mode, you
can hover over traditional (not simplified) characters
to look up chinese words using the dictionary popup.
You can also search for and add entries in Add Vocab
and Edit Vocab windows.
</p>

</div>

</div>

<div id="outline-container-3.2.7" class="outline-4">
<h4 id="sec-3.2.7"><span class="section-number-4">3.2.7</span> <span class="todo TODO"> TODO</span> Add Load Path for dictionaries </h4>
<div class="outline-text-4" id="text-3.2.7">

<p>Create a load path for the dictionaries that prioritizes
directories where the dictionaries might be.  Add /usr/share/edict
to the end of the load path and remove the special configuration
for Debian. This will allow Debian users to install their
own edict dictionary if they don't want to use the old one
in Debian.  This feature is necessary so that we don't have to
jump through hoops to find the cedictionary in Debian.
</p>

</div>

</div>

<div id="outline-container-3.2.8" class="outline-4">
<h4 id="sec-3.2.8"><span class="section-number-4">3.2.8</span> <span class="todo TODO"> TODO</span> Replace Tanaka corpus with Tatoeba example sentences </h4>
<div class="outline-text-4" id="text-3.2.8">

<p>Tatoeba is the replacesment for the Tanaka corpus upstream.
There are 3 CSV files now &ndash; One for collocations, one
for sentence type and one for the old Tanaka B line information.
Read in the Japanese collocations and Tanaka B line information
in Japanese mode.
</p>

</div>

</div>

<div id="outline-container-3.2.9" class="outline-4">
<h4 id="sec-3.2.9"><span class="section-number-4">3.2.9</span> <span class="todo TODO"> TODO</span> Read Chinese collocations from Tatoeba example sentence </h4>
<div class="outline-text-4" id="text-3.2.9">

<p>In Chinese mode, read and select the Chinese collocations.
</p>


</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Finished &ndash; Version 5.1 </h2>
<div class="outline-text-2" id="text-4">


<p>
This is a packaging release.  However, I have added a single
feature because I needed it for my own study.
</p>
<p>
Unlike previous releases, 0.5.1 will be released as a stable release.
For all platforms, installing ruby (with rubygems) and typing "gem
install jldrill" will install jldrill and all its dependencies.  On
On Linux, there will be a debian package.  Both gems and debian packages 
will be submitted to the appropriate people so that it is easy to install.
Unfortunately, unless I can get a Mac, there will be no Mac
installation.
</p>

</div>

<div id="outline-container-4.1" class="outline-4">
<h4 id="sec-4.1"><span class="section-number-4">4.1</span> <span class="done DONE"> DONE</span> Forget items that are too old </h4>
<div class="outline-text-4" id="text-4.1">

<p>Sometimes when you haven't used the app for a long time items
get very old.  Their reviewRate becomes large.  This is not
a problem in itself, but when you start to review items they
will have a short duration.  If the reviewRate is something like
10x, then it might take 50 days until we rereview a new item.
Therefore make a new set of items called Forgetten.  Review
Items that have a reviewRate higher than some threshold (4???)
are moved to the Forgetten set.  Forgetten set items work just like
the Review set items except that are introduced like New set
items.  So this means the user gets Review set items until they
get 90% right.  Then they get Forgetten set items.  Once an expired
set item is reviewed, it goes back into the Review set.  After
all the Forgetten set items are finished, then we go back to showing
New set items.  This gives priority to actively reviewed items
without losing the valuable sorting of old items.
There is an option for setting the threshold.  If the threshold
is 0 (default) then no items are forgotten.
</p>

</div>

</div>

<div id="outline-container-4.2" class="outline-4">
<h4 id="sec-4.2"><span class="section-number-4">4.2</span> <span class="done DONE"> DONE</span> Reorganize Options UI </h4>
<div class="outline-text-4" id="text-4.2">

<p>The UI is ugly and disorganized for the Options window.
Organize the options so that they have a grouping that makes
sense and try to visually improve the look.
</p>

</div>

</div>

<div id="outline-container-4.3" class="outline-4">
<h4 id="sec-4.3"><span class="section-number-4">4.3</span> <span class="done DONE"> DONE</span> Put Gem in official repository [5/5] </h4>
<div class="outline-text-4" id="text-4.3">

<ul>
<li>
<b>[X]</b> Make dependencies for gtk2
</li>
<li>
<b>[X]</b> Push to official repositories
</li>
<li>
<b>[X]</b> Test on Linux and Windows to make sure it installs properly
</li>
<li>
<b>[X]</b> Update documentation for Windows install
</li>
<li>
<b>[X]</b> Document potential problems with debian and gem coexistance.


</li>
</ul>
</div>

</div>

<div id="outline-container-4.4" class="outline-4">
<h4 id="sec-4.4"><span class="section-number-4">4.4</span> <span class="done DONE"> DONE</span> Update Dictionaries </h4>
<div class="outline-text-4" id="text-4.4">

<p>Update the EDict and Tanaka corpus dictionaries to the
latest version.
</p>

</div>

</div>

<div id="outline-container-4.5" class="outline-4">
<h4 id="sec-4.5"><span class="section-number-4">4.5</span> <span class="done DONE"> DONE</span> Switch between kanji and vocab popups </h4>
<div class="outline-text-4" id="text-4.5">

<p>Make it so that you can switch between the kanji and vocab
popups without having to move the mouse in between.
</p>

</div>

</div>

<div id="outline-container-4.6" class="outline-4">
<h4 id="sec-4.6"><span class="section-number-4">4.6</span> <span class="done DONE"> DONE</span> Improve Debian build </h4>
<div class="outline-text-4" id="text-4.6">

<p>The Debian build system was not being done the "Debian way".
Modify it so that it it lintian clean and build a source
package.
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Backlog </h2>
<div class="outline-text-2" id="text-5">


<p>
These items are ideas that may or may not make it into
an upcoming development version.  They are organized loosely
by how important I think they are (the most important is
first).  Simply being on this list is no guarantee that
I will implement it.  However, items near the top are very
likely to appear in the next release or two.  If you have
feedback on this list, or its order, please email me.
</p>

</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Items </h3>
<div class="outline-text-3" id="text-5.1">



</div>

<div id="outline-container-5.1.1" class="outline-4">
<h4 id="sec-5.1.1"><span class="section-number-4">5.1.1</span> <span class="todo TODO"> TODO</span> Ability to switch between Japanese and Chinese mode </h4>
<div class="outline-text-4" id="text-5.1.1">

<p>When when one of the dictionaries is loaded and you load a file
that uses the other language, the previous dictionary remains.
It should not use it in the other language.  If the new language
dictionary is set to autoload, it should autoload, replacing the
previous dictionary in memory.  However, if a new language dictionary
is not loaded, the previous dictionary should not be removed.
</p>
</div>

</div>

<div id="outline-container-5.1.2" class="outline-4">
<h4 id="sec-5.1.2"><span class="section-number-4">5.1.2</span> <span class="todo TODO"> TODO</span> Allow users to update their drills </h4>
<div class="outline-text-4" id="text-5.1.2">

<p>A user can update a drill by appending the new version to their drill.
But if the vocabulary has changed in the new/old drill (because the
dictionary was updated for instance), the new vocabulary will be added
as a new item rather than updating the old item.  Put a unique
ID on each item.  When merging, if the IDs are the same overwrite the old
one.  For old drills, if there is no ID, assume the items are the same
if the position, reading and kanji are the same.  (Not sure about the
position).
</p>

</div>

</div>

<div id="outline-container-5.1.3" class="outline-4">
<h4 id="sec-5.1.3"><span class="section-number-4">5.1.3</span> <span class="todo TODO"> TODO</span> Personalized Directories </h4>
<div class="outline-text-4" id="text-5.1.3">

<p>Create a configuration directory that contains the users configuration
for JLDrill.
</p>

</div>

</div>
