TODO.org
*** TODO Automatically update Dictionary
	Allow the user to select a download site for a dictionary and
	automatically updated it when it changes.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 0
	:END:

*** TODO Automatically update Collocations
	Allow the user to select a download site for a collocation dictionary and
	automatically updated it when it changes.

	:PROPERTIES:
	:JellyBeans: 2
	:Done: 0
	:END:

*** TODO Need a mechanism for publishing warnings and errors.
   Warnings and errors must be displayed to the user in a
   consisten way.  To be honest I need to think more about what
   that way is.  Currently errors are printed to the console
   which is no good.

   :PROPERTIES:
   :JellyBeans: 2
   :Done: 0
   :END:

*** TODO Give feedback to the user when we refuse to edit or add an item.
   Probably use the aforementioned warning and error mechanism.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO When save fails, indicate it to the user 
   before bringing up the save as dialog.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Start new drills in Preview mode
   When a drill has been loaded for the first time (or after a reset), 
   show the first item in preview mode.  This allows the user to
   update the options, or to save the quiz before selecting the first
   problem.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO New Drill Splash Screen
   Create a splash screen explaining that this is a new drill and
   the system is in Preview mode.  Press N to start

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Simply loading a drill shouldn't modify it
   Currently the "must save" flag is set when a drill is loaded.
   This should only be set after the first item has been answered.
   Of course if the drill was imported from an EDICT file then
   the "must save" flag should be set immediately.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Indicate when the item has been promoted.
   When an item has been moved to the review set, print some
   kind of congratulatory message.  Possibly show some kind of
   stats like Anki does.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Windows Packaging [0/5]
   Determine the feasibility of creating a windows packaging.
   Place to start:
   - [ ] Create a self extranting archive that downloads and
		 installs ruby, and then run gem install jldrill
   - [ ] Create an uninstall script.
   - [ ] Create a jldrill upgrade script.
   - [ ] Create an executable with an icon for jldrill
   - [ ] Install icon on the desktop and in the menu.  Add uninstall
		 and upgrade scripts in the menu
   - [ ] Create an installer for the custom fonts

   :PROPERTIES:
   :JellyBeans: 3
   :Done: 0
   :END:

*** TODO Allow Learn/Unlearn for any arbitrary item
*** TODO Define the structure of the data in the drill.  
   In other words, create a dynamic data type that defines the
   structure of the data item that is to be drilled.  Save it in the
   drill itself.  Create a structure for edict vocabulary.

*** TODO Define a structure for grammar.
*** TODO Display parts of speech tags next to what they modify
   (i.e. each definition, or sentence)

*** TODO Allow the user to choose what tags to display.  
   Save this in the drill.

*** TODO Associate data items with the dictionary they belong to.
   Only load the dictionary if it's in the drill. (Question: Should it
   unload the dictionary on next drill?  Probably yes...)

*** TODO 彼処 かしこ finds あそこ 
   When searching the tanaka corpus the reading should be taken into
   account if given.  Thus examples with the same kanji but different
   readings should not be shown.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Allow undo
*** TODO Insert Popup Before Item
   If the user presses a key (TBD) while a popup is up, an item
   contiaining the information in the popup is added to the quiz
   immediately before the current item.

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Aggressive Search
   If a reading can't be found in the dictionary, seach 
   again taking off one character at a time from the end of the
   reading. 

   :PROPERTIES:
   :JellyBeans: 2
   :Done: 0
   :END:

*** TODO Create a recent used menu for loading drills that you've used recently.
*** TODO One of the items in the working set had a potential schedule of 72 days

   :PROPERTIES:
   :JellyBeans: 1
   :Done: 0
   :END:

*** TODO Time to learn after the first item is waaay too big (10798.7s) [1/2]
   - [X] Refactor tests
   - [ ] Test to see if this is a real problem	 

   :PROPERTIES:
   :JellyBeans: 2
   :Done: 0
   :END:

*** TODO Full test coverage for all the model objects
*** TODO Full test coverage for all the contexts
*** TODO Don't steal focus when putting up windows that take no input.  
   Deferred from 0.3.3.  I tried to do it, but it never
   worked.  I suspect a race condition in GTK and it's not important
   enough to kill myself over.

*** TODO Allow user to set the formatting for each type of data.  
   Store the formatting in the drill.

