TODO.html

<div id="outline-container-5.1.4" class="outline-4">
<h4 id="sec-5.1.4"><span class="section-number-4">5.1.4</span> <span class="todo TODO"> TODO</span> Automatically update Dictionary </h4>
<div class="outline-text-4" id="text-5.1.4">

<p>Allow the user to select a download site for a dictionary and
automatically updated it when it changes.
</p>

</div>

</div>

<div id="outline-container-5.1.5" class="outline-4">
<h4 id="sec-5.1.5"><span class="section-number-4">5.1.5</span> <span class="todo TODO"> TODO</span> Automatically update Collocations </h4>
<div class="outline-text-4" id="text-5.1.5">

<p>Allow the user to select a download site for a collocation dictionary and
automatically updated it when it changes.
</p>

</div>

</div>

<div id="outline-container-5.1.6" class="outline-4">
<h4 id="sec-5.1.6"><span class="section-number-4">5.1.6</span> <span class="todo TODO"> TODO</span> Need a mechanism for publishing warnings and errors. </h4>
<div class="outline-text-4" id="text-5.1.6">

<p>Warnings and errors must be displayed to the user in a
consisten way.  To be honest I need to think more about what
that way is.  Currently errors are printed to the console
which is no good.
</p>

</div>

</div>

<div id="outline-container-5.1.7" class="outline-4">
<h4 id="sec-5.1.7"><span class="section-number-4">5.1.7</span> <span class="todo TODO"> TODO</span> Give feedback to the user when we refuse to edit or add an item. </h4>
<div class="outline-text-4" id="text-5.1.7">

<p>Probably use the aforementioned warning and error mechanism.
</p>

</div>

</div>

<div id="outline-container-5.1.8" class="outline-4">
<h4 id="sec-5.1.8"><span class="section-number-4">5.1.8</span> <span class="todo TODO"> TODO</span> When save fails, indicate it to the user </h4>
<div class="outline-text-4" id="text-5.1.8">

<p>before bringing up the save as dialog.
</p>

</div>

</div>

<div id="outline-container-5.1.9" class="outline-4">
<h4 id="sec-5.1.9"><span class="section-number-4">5.1.9</span> <span class="todo TODO"> TODO</span> Start new drills in Preview mode </h4>
<div class="outline-text-4" id="text-5.1.9">

<p>When a drill has been loaded for the first time (or after a reset), 
show the first item in preview mode.  This allows the user to
update the options, or to save the quiz before selecting the first
problem.
</p>

</div>

</div>

<div id="outline-container-5.1.10" class="outline-4">
<h4 id="sec-5.1.10"><span class="section-number-4">5.1.10</span> <span class="todo TODO"> TODO</span> New Drill Splash Screen </h4>
<div class="outline-text-4" id="text-5.1.10">

<p>Create a splash screen explaining that this is a new drill and
the system is in Preview mode.  Press N to start
</p>

</div>

</div>

<div id="outline-container-5.1.11" class="outline-4">
<h4 id="sec-5.1.11"><span class="section-number-4">5.1.11</span> <span class="todo TODO"> TODO</span> Simply loading a drill shouldn't modify it </h4>
<div class="outline-text-4" id="text-5.1.11">

<p>Currently the "must save" flag is set when a drill is loaded.
This should only be set after the first item has been answered.
Of course if the drill was imported from an EDICT file then
the "must save" flag should be set immediately.
</p>

</div>

</div>

<div id="outline-container-5.1.12" class="outline-4">
<h4 id="sec-5.1.12"><span class="section-number-4">5.1.12</span> <span class="todo TODO"> TODO</span> Indicate when the item has been promoted. </h4>
<div class="outline-text-4" id="text-5.1.12">

<p>When an item has been moved to the review set, print some
kind of congratulatory message.  Possibly show some kind of
stats like Anki does.
</p>

</div>

</div>

<div id="outline-container-5.1.13" class="outline-4">
<h4 id="sec-5.1.13"><span class="section-number-4">5.1.13</span> <span class="todo TODO"> TODO</span> Windows Packaging [0/5] </h4>
<div class="outline-text-4" id="text-5.1.13">

<p>Determine the feasibility of creating a windows packaging.
Place to start:
</p><ul>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Create a self extranting archive that downloads and
installs ruby, and then run gem install jldrill
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Create an uninstall script.
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Create a jldrill upgrade script.
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Create an executable with an icon for jldrill
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Install icon on the desktop and in the menu.  Add uninstall
and upgrade scripts in the menu
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Create an installer for the custom fonts


</li>
</ul>
</div>

</div>

<div id="outline-container-5.1.14" class="outline-4">
<h4 id="sec-5.1.14"><span class="section-number-4">5.1.14</span> <span class="todo TODO"> TODO</span> Allow Learn/Unlearn for any arbitrary item </h4>
<div class="outline-text-4" id="text-5.1.14">

</div>

</div>

<div id="outline-container-5.1.15" class="outline-4">
<h4 id="sec-5.1.15"><span class="section-number-4">5.1.15</span> <span class="todo TODO"> TODO</span> Define the structure of the data in the drill. </h4>
<div class="outline-text-4" id="text-5.1.15">

<p>In other words, create a dynamic data type that defines the
structure of the data item that is to be drilled.  Save it in the
drill itself.  Create a structure for edict vocabulary.
</p>
</div>

</div>

<div id="outline-container-5.1.16" class="outline-4">
<h4 id="sec-5.1.16"><span class="section-number-4">5.1.16</span> <span class="todo TODO"> TODO</span> Define a structure for grammar. </h4>
<div class="outline-text-4" id="text-5.1.16">

</div>

</div>

<div id="outline-container-5.1.17" class="outline-4">
<h4 id="sec-5.1.17"><span class="section-number-4">5.1.17</span> <span class="todo TODO"> TODO</span> Display parts of speech tags next to what they modify </h4>
<div class="outline-text-4" id="text-5.1.17">

<p>(i.e. each definition, or sentence)
</p>
</div>

</div>

<div id="outline-container-5.1.18" class="outline-4">
<h4 id="sec-5.1.18"><span class="section-number-4">5.1.18</span> <span class="todo TODO"> TODO</span> Allow the user to choose what tags to display. </h4>
<div class="outline-text-4" id="text-5.1.18">

<p>Save this in the drill.
</p>
</div>

</div>

<div id="outline-container-5.1.19" class="outline-4">
<h4 id="sec-5.1.19"><span class="section-number-4">5.1.19</span> <span class="todo TODO"> TODO</span> Associate data items with the dictionary they belong to. </h4>
<div class="outline-text-4" id="text-5.1.19">

<p>Only load the dictionary if it's in the drill. (Question: Should it
unload the dictionary on next drill?  Probably yes&hellip;)
</p>
</div>

</div>

<div id="outline-container-5.1.20" class="outline-4">
<h4 id="sec-5.1.20"><span class="section-number-4">5.1.20</span> <span class="todo TODO"> TODO</span> 彼処 かしこ finds あそこ </h4>
<div class="outline-text-4" id="text-5.1.20">

<p>When searching the tanaka corpus the reading should be taken into
account if given.  Thus examples with the same kanji but different
readings should not be shown.
</p>

</div>

</div>

<div id="outline-container-5.1.21" class="outline-4">
<h4 id="sec-5.1.21"><span class="section-number-4">5.1.21</span> <span class="todo TODO"> TODO</span> Allow undo </h4>
<div class="outline-text-4" id="text-5.1.21">

</div>

</div>

<div id="outline-container-5.1.22" class="outline-4">
<h4 id="sec-5.1.22"><span class="section-number-4">5.1.22</span> <span class="todo TODO"> TODO</span> Insert Popup Before Item </h4>
<div class="outline-text-4" id="text-5.1.22">

<p>If the user presses a key (TBD) while a popup is up, an item
contiaining the information in the popup is added to the quiz
immediately before the current item.
</p>

</div>

</div>

<div id="outline-container-5.1.23" class="outline-4">
<h4 id="sec-5.1.23"><span class="section-number-4">5.1.23</span> <span class="todo TODO"> TODO</span> Aggressive Search </h4>
<div class="outline-text-4" id="text-5.1.23">

<p>If a reading can't be found in the dictionary, seach 
again taking off one character at a time from the end of the
reading. 
</p>

</div>

</div>

<div id="outline-container-5.1.24" class="outline-4">
<h4 id="sec-5.1.24"><span class="section-number-4">5.1.24</span> <span class="todo TODO"> TODO</span> Create a recent used menu for loading drills that you've used recently. </h4>
<div class="outline-text-4" id="text-5.1.24">

</div>

</div>

<div id="outline-container-5.1.25" class="outline-4">
<h4 id="sec-5.1.25"><span class="section-number-4">5.1.25</span> <span class="todo TODO"> TODO</span> One of the items in the working set had a potential schedule of 72 days </h4>
<div class="outline-text-4" id="text-5.1.25">



</div>

</div>

<div id="outline-container-5.1.26" class="outline-4">
<h4 id="sec-5.1.26"><span class="section-number-4">5.1.26</span> <span class="todo TODO"> TODO</span> Time to learn after the first item is waaay too big (10798.7s) [1/2] </h4>
<div class="outline-text-4" id="text-5.1.26">

<ul>
<li>
<b>[X]</b> Refactor tests
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> Test to see if this is a real problem   


</li>
</ul>
</div>

</div>

<div id="outline-container-5.1.27" class="outline-4">
<h4 id="sec-5.1.27"><span class="section-number-4">5.1.27</span> <span class="todo TODO"> TODO</span> Full test coverage for all the model objects </h4>
<div class="outline-text-4" id="text-5.1.27">

</div>

</div>

<div id="outline-container-5.1.28" class="outline-4">
<h4 id="sec-5.1.28"><span class="section-number-4">5.1.28</span> <span class="todo TODO"> TODO</span> Full test coverage for all the contexts </h4>
<div class="outline-text-4" id="text-5.1.28">

</div>

</div>

<div id="outline-container-5.1.29" class="outline-4">
<h4 id="sec-5.1.29"><span class="section-number-4">5.1.29</span> <span class="todo TODO"> TODO</span> Don't steal focus when putting up windows that take no input. </h4>
<div class="outline-text-4" id="text-5.1.29">

<p>Deferred from 0.3.3.  I tried to do it, but it never
worked.  I suspect a race condition in GTK and it's not important
enough to kill myself over.
</p>
</div>

</div>

<div id="outline-container-5.1.30" class="outline-4">
<h4 id="sec-5.1.30"><span class="section-number-4">5.1.30</span> <span class="todo TODO"> TODO</span> Allow user to set the formatting for each type of data. </h4>
<div class="outline-text-4" id="text-5.1.30">

<p>Store the formatting in the drill.
</p>
</div>

</div>
