TODO.html

<div id="outline-container-5.1.31" class="outline-4">
<h4 id="sec-5.1.31"><span class="section-number-4">5.1.31</span> <span class="todo TODO"> TODO</span> Rename the methods that take Vocabulary </h4>
<div class="outline-text-4" id="text-5.1.31">

<p>(like Quiz#add()) to indicate that it's for Vocabulary (i.e.,
Quiz#addVocab())
</p>
</div>

</div>

<div id="outline-container-5.1.32" class="outline-4">
<h4 id="sec-5.1.32"><span class="section-number-4">5.1.32</span> <span class="todo TODO"> TODO</span> Create a keyboard only mode. </h4>
<div class="outline-text-4" id="text-5.1.32">

<p>Advanced users can probably just use the keyboard.  In this mode,
Remove any UI that is surpulfluous.
</p>
</div>

</div>

<div id="outline-container-5.1.33" class="outline-4">
<h4 id="sec-5.1.33"><span class="section-number-4">5.1.33</span> <span class="todo TODO"> TODO</span> Create a dictionary back end to allow it to use online dictionaries, </h4>
<div class="outline-text-4" id="text-5.1.33">

<p>or dictionary servers (fantasdic? stardict?)
</p>
</div>

</div>

<div id="outline-container-5.1.34" class="outline-4">
<h4 id="sec-5.1.34"><span class="section-number-4">5.1.34</span> <span class="todo TODO"> TODO</span> Create Redhat packaging. </h4>
<div class="outline-text-4" id="text-5.1.34">

</div>

</div>

<div id="outline-container-5.1.35" class="outline-4">
<h4 id="sec-5.1.35"><span class="section-number-4">5.1.35</span> <span class="todo TODO"> TODO</span> Create OSX packaging. </h4>
<div class="outline-text-4" id="text-5.1.35">

</div>

</div>

<div id="outline-container-5.1.36" class="outline-4">
<h4 id="sec-5.1.36"><span class="section-number-4">5.1.36</span> <span class="todo TODO"> TODO</span> Allow user to modify the global backoff. </h4>
<div class="outline-text-4" id="text-5.1.36">

<p>Allow the user to modify the global backoff from the options.  This
must be saved with the drill.  When the backoff is changed, all the
items that are currently scheduled will have to be scaled
accordingly.  For example, if the backoff changes from 2.0 to 1.5,
if there was an item with a duration of 10, then the duration
becomes 7.5.  If the item had been waiting for 5 days (50% of the
duration), then reset it so that it has been waiting for 3.75 days
(50% of 7.5).  Then resort all the items.
</p>

</div>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Mike Charlton
<a href="mailto:mike@Wrook">&lt;mike@Wrook&gt;</a>
</p>
<p class="date"> Date: 2012-01-12 09:46:27 JST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
